# -*- coding: utf8 -*-

'''
在ImageNet上。 请注意，使用TensorFlow时，
为了获得最佳性能，您应该设置
在你的Keras配置中的image_data_format =“channels_last”
在~/.keras/keras.json

https://github.com/fchollet/deep-learning-models/releases/  存放各种训练好的模型

数据说明： 
数据下载：https://download.pytorch.org/tutorial/hymenoptera_data.zip
目录结构：
ls hymenoptera_data  
==>train  val (训练与验证目录)

ls hymenoptera_data/train
==>ants  bees (2种类 每一类别放在一个文件夹下)

ls hymenoptera_data/train/ants
==> *.jpg (存放的图片)
'''

import matplotlib.pyplot as plt
import PIL
import tensorflow as tf
import numpy as np
import os

# These are the imports from the Keras API.
# Note the long format which can hopefully be shortened in the future to e.g.
# from tf.keras.models import Model.
from tensorflow.python.keras.models import Model, Sequential
from tensorflow.python.keras.layers import Dense, Flatten, Dropout
# from tensorflow.python.keras.applications import VGG16 #,VGG19 ,ResNet50 ,InceptionV3
# from tensorflow.python.keras.applications.vgg16 import decode_predictions ,preprocess_input

from tensorflow.python.keras._impl.keras.applications.inception_v3 import decode_predictions,preprocess_input
from tensorflow.python.keras._impl.keras.applications.inception_v3 import InceptionV3


from tensorflow.python.keras.preprocessing.image import ImageDataGenerator
from tensorflow.python.keras.optimizers import Adam, RMSprop

# 帮助函数用于加入目录和文件名列表
def path_join(dirname, filenames):
    return [os.path.join(dirname, filename) for filename in filenames]
'''
下面使用Keras API创建预先训练的VGG16模型的一个实例。 
这会自动下载所需的文件，如果你还没有。 请注意，Keras与Tutorial＃08相比有多简单。
VGG16模型包含卷积部分和用于分类的完全连接（或密集）部分。 如果include_top = True，
则整个VGG16模型下载大约528 MB。 如果include_top = False，则只下载VGG16模型的卷积部分，仅为57 MB。
我们将尝试使用预先训练的模型来预测新数据集中某些图像的类别，因此我们必须下载完整模型，
但是如果您的网络连接速度较慢，则可以修改以下代码以使用 较小的预先训练的模型，不需要分类层。
'''
# 迁移学习只用到卷积层部分 理论上include_top=False 可行 (include_top=False 后面会报错 不知道为什么？)
model = InceptionV3(include_top=True, weights='imagenet')

# 模型下载到 ~/.keras/models
# 手动下载模型 并存储在 ~/.keras/models （目录下）
'''
cd ~
mkdir -p  .keras/models
在 https://github.com/fchollet/deep-learning-models/releases/ 下载
vgg16_weights_tf_dim_ordering_tf_kernels.h5
'''

# Keras API有自己的创建输入流水线的方法来使用文件来训练模型。
# 首先，我们需要知道由预先训练的VGG16模型输入的张量的形状。 在这种情况下，它是形状224 x 224 x 3的图像。

# input_shape = model.layers[0].output_shape[1:3]
input_shape=(299,299) # inception 输入shape [299,299,3]

# 文件路径
train_dir = '../../hymenoptera_data/train'
test_dir = '../../hymenoptera_data/val'


'''
Keras使用所谓的数据发生器来将数据输入到神经网络中，这将使数据在永久的环境中循环。
我们有一个小的训练集，所以通过对图像进行各种转换来人为地增大其大小是有帮助的。 
我们使用一个内置的数据生成器，可以进行这些随机转换。 这也被称为增强数据集。
'''
datagen_train = ImageDataGenerator(
      rescale=1./255,
      rotation_range=180,
      width_shift_range=0.1,
      height_shift_range=0.1,
      shear_range=0.1,
      zoom_range=[0.9, 1.5],
      horizontal_flip=True,
      vertical_flip=True,
      fill_mode='nearest')


'''
我们还需要一个用于测试集的数据生成器，但是这不应该对图像进行任何转换，
因为我们想要知道这些特定图像的精确分类准确性。 所以我们只是重新调整像素值，
使它们在0.0到1.0之间，因为这是VGG16模型所期望的。
'''
datagen_test = ImageDataGenerator(rescale=1./255)

# 数据生成器将返回批量的图像。 由于VGG16型号太大，批量不能太大，否则GPU内存不足。
batch_size = 20
'''
我们可以在训练过程中保存随机变换的图像，以检查它们是否过度失真，所以我们必须调整上面的数据生成器的参数。
'''
if True:
    save_to_dir = None
else:
    save_to_dir='augmented_images/'

'''
现在我们创建实际的数据生成器，它将从磁盘读取文件，调整图像的大小并返回一个随机批次。
将数据生成器的构建分成这两个步骤是有些尴尬的，但这可能是因为有不同类型的数据生成器
可用于不同的数据类型（图像，文本等）和源（内存 或磁盘）。
'''
generator_train = datagen_train.flow_from_directory(directory=train_dir,
                                                    target_size=input_shape,
                                                    batch_size=batch_size,
                                                    shuffle=True,
                                                    save_to_dir=save_to_dir)

'''
找到了属于3个类的4170个图像。
测试集的数据生成器不应该对图像进行转换和混洗。
'''
generator_test = datagen_test.flow_from_directory(directory=test_dir,
                                                  target_size=input_shape,
                                                  batch_size=batch_size,
                                                  shuffle=False)

'''
发现属于3个类的530个图像。
由于数据生成器将永久循环，因此我们需要指定在测试集评估和预测期间要执行的步骤数。 
由于我们的测试集包含530个图像，并且批处理大小设置为20，因此对测试集进行一次完整处理的步数为26.5。 
这就是为什么我们需要在上面的example_errors（）函数中重置数据生成器的计数器，所以它总是从测试集的开始处开始处理。
这是Keras API的另一个稍微尴尬的方面，或许可以改进。
'''
steps_test = generator_test.n / batch_size
# steps_test # 26.5

# 获取训练集和测试集中所有图像的文件路径。
image_paths_train = path_join(train_dir, generator_train.filenames)
image_paths_test = path_join(test_dir, generator_test.filenames)

# 获取训练集和测试集中所有图像的类别编号
cls_train = generator_train.classes
cls_test = generator_test.classes

# 获取数据集的类名称。
class_names = list(generator_train.class_indices.keys())
# class_names # ['forky', 'knifey', 'spoony']

# 获取数据集的类别总数。
num_classes = generator_train.num_class
# print(num_classes)

# 数据集相当不平衡,在这里，我们使用scikit-learn来计算将适当平衡数据集的权重。
# 在训练期间将这些权重应用于批次中的每个图像的梯度，以便缩放对批次的总体梯度的影响
from sklearn.utils.class_weight import compute_class_weight
class_weight = compute_class_weight(class_weight='balanced',
                                    classes=np.unique(cls_train),
                                    y=cls_train)
# print(class_weight)

# 迁移学习
'''
预先训练的VGG16模型无法分类来自Knifey-Spoony数据集的图像。 
原因可能是VGG16模型是在所谓的ImageNet数据集上进行训练的，可能没有包含许多餐具图像。
卷积神经网络的较低层可以识别图像中的许多不同形状或特征。 它是将这些特征组合成整个图像分类的最后几个完全连通的图层。
因此，我们可以尝试将VGG16模型的最后一个卷积层的输出重新路由到一个新的完全连接的神经网络，我们创建这个网络是为了在Knifey-Spoony数据集上进行分类。

首先我们打印VGG16模型的摘要，以便我们可以看到它的图层的名称和类型，以及层之间流动张量的形状。 
这是我们在本教程中使用VGG16模型的主要原因之一，因为Inception v3模型有很多图层，打印出来会令人困惑。
'''

# model.summary()
# print(model)
# exit(-1)
'''
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, None, None, 3) 0                                            
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, None, None, 32 864         input_1[0][0]                    
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, None, None, 32 96          conv2d_1[0][0]                   
____________________________________________________________________________________________________
activation_1 (Activation)        (None, None, None, 32 0           batch_normalization_1[0][0]      
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, None, None, 32 9216        activation_1[0][0]               
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, None, None, 32 96          conv2d_2[0][0]                   
____________________________________________________________________________________________________
activation_2 (Activation)        (None, None, None, 32 0           batch_normalization_2[0][0]      
____________________________________________________________________________________________________
conv2d_3 (Conv2D)                (None, None, None, 64 18432       activation_2[0][0]               
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, None, None, 64 192         conv2d_3[0][0]                   
____________________________________________________________________________________________________
activation_3 (Activation)        (None, None, None, 64 0           batch_normalization_3[0][0]      
____________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)   (None, None, None, 64 0           activation_3[0][0]               
____________________________________________________________________________________________________
conv2d_4 (Conv2D)                (None, None, None, 80 5120        max_pooling2d_1[0][0]            
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, None, None, 80 240         conv2d_4[0][0]                   
____________________________________________________________________________________________________
activation_4 (Activation)        (None, None, None, 80 0           batch_normalization_4[0][0]      
____________________________________________________________________________________________________
conv2d_5 (Conv2D)                (None, None, None, 19 138240      activation_4[0][0]               
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, None, None, 19 576         conv2d_5[0][0]                   
____________________________________________________________________________________________________
activation_5 (Activation)        (None, None, None, 19 0           batch_normalization_5[0][0]      
____________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)   (None, None, None, 19 0           activation_5[0][0]               
____________________________________________________________________________________________________
conv2d_9 (Conv2D)                (None, None, None, 64 12288       max_pooling2d_2[0][0]            
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, None, None, 64 192         conv2d_9[0][0]                   
____________________________________________________________________________________________________
activation_9 (Activation)        (None, None, None, 64 0           batch_normalization_9[0][0]      
____________________________________________________________________________________________________
conv2d_7 (Conv2D)                (None, None, None, 48 9216        max_pooling2d_2[0][0]            
____________________________________________________________________________________________________
conv2d_10 (Conv2D)               (None, None, None, 96 55296       activation_9[0][0]               
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, None, None, 48 144         conv2d_7[0][0]                   
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, None, None, 96 288         conv2d_10[0][0]                  
____________________________________________________________________________________________________
activation_7 (Activation)        (None, None, None, 48 0           batch_normalization_7[0][0]      
____________________________________________________________________________________________________
activation_10 (Activation)       (None, None, None, 96 0           batch_normalization_10[0][0]     
____________________________________________________________________________________________________
average_pooling2d_1 (AveragePool (None, None, None, 19 0           max_pooling2d_2[0][0]            
____________________________________________________________________________________________________
conv2d_6 (Conv2D)                (None, None, None, 64 12288       max_pooling2d_2[0][0]            
____________________________________________________________________________________________________
conv2d_8 (Conv2D)                (None, None, None, 64 76800       activation_7[0][0]               
____________________________________________________________________________________________________
conv2d_11 (Conv2D)               (None, None, None, 96 82944       activation_10[0][0]              
____________________________________________________________________________________________________
conv2d_12 (Conv2D)               (None, None, None, 32 6144        average_pooling2d_1[0][0]        
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, None, None, 64 192         conv2d_6[0][0]                   
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, None, None, 64 192         conv2d_8[0][0]                   
____________________________________________________________________________________________________
batch_normalization_11 (BatchNor (None, None, None, 96 288         conv2d_11[0][0]                  
____________________________________________________________________________________________________
batch_normalization_12 (BatchNor (None, None, None, 32 96          conv2d_12[0][0]                  
____________________________________________________________________________________________________
activation_6 (Activation)        (None, None, None, 64 0           batch_normalization_6[0][0]      
____________________________________________________________________________________________________
activation_8 (Activation)        (None, None, None, 64 0           batch_normalization_8[0][0]      
____________________________________________________________________________________________________
activation_11 (Activation)       (None, None, None, 96 0           batch_normalization_11[0][0]     
____________________________________________________________________________________________________
activation_12 (Activation)       (None, None, None, 32 0           batch_normalization_12[0][0]     
____________________________________________________________________________________________________
mixed0 (Concatenate)             (None, None, None, 25 0           activation_6[0][0]               
                                                                   activation_8[0][0]               
                                                                   activation_11[0][0]              
                                                                   activation_12[0][0]              
____________________________________________________________________________________________________
conv2d_16 (Conv2D)               (None, None, None, 64 16384       mixed0[0][0]                     
____________________________________________________________________________________________________
batch_normalization_16 (BatchNor (None, None, None, 64 192         conv2d_16[0][0]                  
____________________________________________________________________________________________________
activation_16 (Activation)       (None, None, None, 64 0           batch_normalization_16[0][0]     
____________________________________________________________________________________________________
conv2d_14 (Conv2D)               (None, None, None, 48 12288       mixed0[0][0]                     
____________________________________________________________________________________________________
conv2d_17 (Conv2D)               (None, None, None, 96 55296       activation_16[0][0]              
____________________________________________________________________________________________________
batch_normalization_14 (BatchNor (None, None, None, 48 144         conv2d_14[0][0]                  
____________________________________________________________________________________________________
batch_normalization_17 (BatchNor (None, None, None, 96 288         conv2d_17[0][0]                  
____________________________________________________________________________________________________
activation_14 (Activation)       (None, None, None, 48 0           batch_normalization_14[0][0]     
____________________________________________________________________________________________________
activation_17 (Activation)       (None, None, None, 96 0           batch_normalization_17[0][0]     
____________________________________________________________________________________________________
average_pooling2d_2 (AveragePool (None, None, None, 25 0           mixed0[0][0]                     
____________________________________________________________________________________________________
conv2d_13 (Conv2D)               (None, None, None, 64 16384       mixed0[0][0]                     
____________________________________________________________________________________________________
conv2d_15 (Conv2D)               (None, None, None, 64 76800       activation_14[0][0]              
____________________________________________________________________________________________________
conv2d_18 (Conv2D)               (None, None, None, 96 82944       activation_17[0][0]              
____________________________________________________________________________________________________
conv2d_19 (Conv2D)               (None, None, None, 64 16384       average_pooling2d_2[0][0]        
____________________________________________________________________________________________________
batch_normalization_13 (BatchNor (None, None, None, 64 192         conv2d_13[0][0]                  
____________________________________________________________________________________________________
batch_normalization_15 (BatchNor (None, None, None, 64 192         conv2d_15[0][0]                  
____________________________________________________________________________________________________
batch_normalization_18 (BatchNor (None, None, None, 96 288         conv2d_18[0][0]                  
____________________________________________________________________________________________________
batch_normalization_19 (BatchNor (None, None, None, 64 192         conv2d_19[0][0]                  
____________________________________________________________________________________________________
activation_13 (Activation)       (None, None, None, 64 0           batch_normalization_13[0][0]     
____________________________________________________________________________________________________
activation_15 (Activation)       (None, None, None, 64 0           batch_normalization_15[0][0]     
____________________________________________________________________________________________________
activation_18 (Activation)       (None, None, None, 96 0           batch_normalization_18[0][0]     
____________________________________________________________________________________________________
activation_19 (Activation)       (None, None, None, 64 0           batch_normalization_19[0][0]     
____________________________________________________________________________________________________
mixed1 (Concatenate)             (None, None, None, 28 0           activation_13[0][0]              
                                                                   activation_15[0][0]              
                                                                   activation_18[0][0]              
                                                                   activation_19[0][0]              
____________________________________________________________________________________________________
conv2d_23 (Conv2D)               (None, None, None, 64 18432       mixed1[0][0]                     
____________________________________________________________________________________________________
batch_normalization_23 (BatchNor (None, None, None, 64 192         conv2d_23[0][0]                  
____________________________________________________________________________________________________
activation_23 (Activation)       (None, None, None, 64 0           batch_normalization_23[0][0]     
____________________________________________________________________________________________________
conv2d_21 (Conv2D)               (None, None, None, 48 13824       mixed1[0][0]                     
____________________________________________________________________________________________________
conv2d_24 (Conv2D)               (None, None, None, 96 55296       activation_23[0][0]              
____________________________________________________________________________________________________
batch_normalization_21 (BatchNor (None, None, None, 48 144         conv2d_21[0][0]                  
____________________________________________________________________________________________________
batch_normalization_24 (BatchNor (None, None, None, 96 288         conv2d_24[0][0]                  
____________________________________________________________________________________________________
activation_21 (Activation)       (None, None, None, 48 0           batch_normalization_21[0][0]     
____________________________________________________________________________________________________
activation_24 (Activation)       (None, None, None, 96 0           batch_normalization_24[0][0]     
____________________________________________________________________________________________________
average_pooling2d_3 (AveragePool (None, None, None, 28 0           mixed1[0][0]                     
____________________________________________________________________________________________________
conv2d_20 (Conv2D)               (None, None, None, 64 18432       mixed1[0][0]                     
____________________________________________________________________________________________________
conv2d_22 (Conv2D)               (None, None, None, 64 76800       activation_21[0][0]              
____________________________________________________________________________________________________
conv2d_25 (Conv2D)               (None, None, None, 96 82944       activation_24[0][0]              
____________________________________________________________________________________________________
conv2d_26 (Conv2D)               (None, None, None, 64 18432       average_pooling2d_3[0][0]        
____________________________________________________________________________________________________
batch_normalization_20 (BatchNor (None, None, None, 64 192         conv2d_20[0][0]                  
____________________________________________________________________________________________________
batch_normalization_22 (BatchNor (None, None, None, 64 192         conv2d_22[0][0]                  
____________________________________________________________________________________________________
batch_normalization_25 (BatchNor (None, None, None, 96 288         conv2d_25[0][0]                  
____________________________________________________________________________________________________
batch_normalization_26 (BatchNor (None, None, None, 64 192         conv2d_26[0][0]                  
____________________________________________________________________________________________________
activation_20 (Activation)       (None, None, None, 64 0           batch_normalization_20[0][0]     
____________________________________________________________________________________________________
activation_22 (Activation)       (None, None, None, 64 0           batch_normalization_22[0][0]     
____________________________________________________________________________________________________
activation_25 (Activation)       (None, None, None, 96 0           batch_normalization_25[0][0]     
____________________________________________________________________________________________________
activation_26 (Activation)       (None, None, None, 64 0           batch_normalization_26[0][0]     
____________________________________________________________________________________________________
mixed2 (Concatenate)             (None, None, None, 28 0           activation_20[0][0]              
                                                                   activation_22[0][0]              
                                                                   activation_25[0][0]              
                                                                   activation_26[0][0]              
____________________________________________________________________________________________________
conv2d_28 (Conv2D)               (None, None, None, 64 18432       mixed2[0][0]                     
____________________________________________________________________________________________________
batch_normalization_28 (BatchNor (None, None, None, 64 192         conv2d_28[0][0]                  
____________________________________________________________________________________________________
activation_28 (Activation)       (None, None, None, 64 0           batch_normalization_28[0][0]     
____________________________________________________________________________________________________
conv2d_29 (Conv2D)               (None, None, None, 96 55296       activation_28[0][0]              
____________________________________________________________________________________________________
batch_normalization_29 (BatchNor (None, None, None, 96 288         conv2d_29[0][0]                  
____________________________________________________________________________________________________
activation_29 (Activation)       (None, None, None, 96 0           batch_normalization_29[0][0]     
____________________________________________________________________________________________________
conv2d_27 (Conv2D)               (None, None, None, 38 995328      mixed2[0][0]                     
____________________________________________________________________________________________________
conv2d_30 (Conv2D)               (None, None, None, 96 82944       activation_29[0][0]              
____________________________________________________________________________________________________
batch_normalization_27 (BatchNor (None, None, None, 38 1152        conv2d_27[0][0]                  
____________________________________________________________________________________________________
batch_normalization_30 (BatchNor (None, None, None, 96 288         conv2d_30[0][0]                  
____________________________________________________________________________________________________
activation_27 (Activation)       (None, None, None, 38 0           batch_normalization_27[0][0]     
____________________________________________________________________________________________________
activation_30 (Activation)       (None, None, None, 96 0           batch_normalization_30[0][0]     
____________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)   (None, None, None, 28 0           mixed2[0][0]                     
____________________________________________________________________________________________________
mixed3 (Concatenate)             (None, None, None, 76 0           activation_27[0][0]              
                                                                   activation_30[0][0]              
                                                                   max_pooling2d_3[0][0]            
____________________________________________________________________________________________________
conv2d_35 (Conv2D)               (None, None, None, 12 98304       mixed3[0][0]                     
____________________________________________________________________________________________________
batch_normalization_35 (BatchNor (None, None, None, 12 384         conv2d_35[0][0]                  
____________________________________________________________________________________________________
activation_35 (Activation)       (None, None, None, 12 0           batch_normalization_35[0][0]     
____________________________________________________________________________________________________
conv2d_36 (Conv2D)               (None, None, None, 12 114688      activation_35[0][0]              
____________________________________________________________________________________________________
batch_normalization_36 (BatchNor (None, None, None, 12 384         conv2d_36[0][0]                  
____________________________________________________________________________________________________
activation_36 (Activation)       (None, None, None, 12 0           batch_normalization_36[0][0]     
____________________________________________________________________________________________________
conv2d_32 (Conv2D)               (None, None, None, 12 98304       mixed3[0][0]                     
____________________________________________________________________________________________________
conv2d_37 (Conv2D)               (None, None, None, 12 114688      activation_36[0][0]              
____________________________________________________________________________________________________
batch_normalization_32 (BatchNor (None, None, None, 12 384         conv2d_32[0][0]                  
____________________________________________________________________________________________________
batch_normalization_37 (BatchNor (None, None, None, 12 384         conv2d_37[0][0]                  
____________________________________________________________________________________________________
activation_32 (Activation)       (None, None, None, 12 0           batch_normalization_32[0][0]     
____________________________________________________________________________________________________
activation_37 (Activation)       (None, None, None, 12 0           batch_normalization_37[0][0]     
____________________________________________________________________________________________________
conv2d_33 (Conv2D)               (None, None, None, 12 114688      activation_32[0][0]              
____________________________________________________________________________________________________
conv2d_38 (Conv2D)               (None, None, None, 12 114688      activation_37[0][0]              
____________________________________________________________________________________________________
batch_normalization_33 (BatchNor (None, None, None, 12 384         conv2d_33[0][0]                  
____________________________________________________________________________________________________
batch_normalization_38 (BatchNor (None, None, None, 12 384         conv2d_38[0][0]                  
____________________________________________________________________________________________________
activation_33 (Activation)       (None, None, None, 12 0           batch_normalization_33[0][0]     
____________________________________________________________________________________________________
activation_38 (Activation)       (None, None, None, 12 0           batch_normalization_38[0][0]     
____________________________________________________________________________________________________
average_pooling2d_4 (AveragePool (None, None, None, 76 0           mixed3[0][0]                     
____________________________________________________________________________________________________
conv2d_31 (Conv2D)               (None, None, None, 19 147456      mixed3[0][0]                     
____________________________________________________________________________________________________
conv2d_34 (Conv2D)               (None, None, None, 19 172032      activation_33[0][0]              
____________________________________________________________________________________________________
conv2d_39 (Conv2D)               (None, None, None, 19 172032      activation_38[0][0]              
____________________________________________________________________________________________________
conv2d_40 (Conv2D)               (None, None, None, 19 147456      average_pooling2d_4[0][0]        
____________________________________________________________________________________________________
batch_normalization_31 (BatchNor (None, None, None, 19 576         conv2d_31[0][0]                  
____________________________________________________________________________________________________
batch_normalization_34 (BatchNor (None, None, None, 19 576         conv2d_34[0][0]                  
____________________________________________________________________________________________________
batch_normalization_39 (BatchNor (None, None, None, 19 576         conv2d_39[0][0]                  
____________________________________________________________________________________________________
batch_normalization_40 (BatchNor (None, None, None, 19 576         conv2d_40[0][0]                  
____________________________________________________________________________________________________
activation_31 (Activation)       (None, None, None, 19 0           batch_normalization_31[0][0]     
____________________________________________________________________________________________________
activation_34 (Activation)       (None, None, None, 19 0           batch_normalization_34[0][0]     
____________________________________________________________________________________________________
activation_39 (Activation)       (None, None, None, 19 0           batch_normalization_39[0][0]     
____________________________________________________________________________________________________
activation_40 (Activation)       (None, None, None, 19 0           batch_normalization_40[0][0]     
____________________________________________________________________________________________________
mixed4 (Concatenate)             (None, None, None, 76 0           activation_31[0][0]              
                                                                   activation_34[0][0]              
                                                                   activation_39[0][0]              
                                                                   activation_40[0][0]              
____________________________________________________________________________________________________
conv2d_45 (Conv2D)               (None, None, None, 16 122880      mixed4[0][0]                     
____________________________________________________________________________________________________
batch_normalization_45 (BatchNor (None, None, None, 16 480         conv2d_45[0][0]                  
____________________________________________________________________________________________________
activation_45 (Activation)       (None, None, None, 16 0           batch_normalization_45[0][0]     
____________________________________________________________________________________________________
conv2d_46 (Conv2D)               (None, None, None, 16 179200      activation_45[0][0]              
____________________________________________________________________________________________________
batch_normalization_46 (BatchNor (None, None, None, 16 480         conv2d_46[0][0]                  
____________________________________________________________________________________________________
activation_46 (Activation)       (None, None, None, 16 0           batch_normalization_46[0][0]     
____________________________________________________________________________________________________
conv2d_42 (Conv2D)               (None, None, None, 16 122880      mixed4[0][0]                     
____________________________________________________________________________________________________
conv2d_47 (Conv2D)               (None, None, None, 16 179200      activation_46[0][0]              
____________________________________________________________________________________________________
batch_normalization_42 (BatchNor (None, None, None, 16 480         conv2d_42[0][0]                  
____________________________________________________________________________________________________
batch_normalization_47 (BatchNor (None, None, None, 16 480         conv2d_47[0][0]                  
____________________________________________________________________________________________________
activation_42 (Activation)       (None, None, None, 16 0           batch_normalization_42[0][0]     
____________________________________________________________________________________________________
activation_47 (Activation)       (None, None, None, 16 0           batch_normalization_47[0][0]     
____________________________________________________________________________________________________
conv2d_43 (Conv2D)               (None, None, None, 16 179200      activation_42[0][0]              
____________________________________________________________________________________________________
conv2d_48 (Conv2D)               (None, None, None, 16 179200      activation_47[0][0]              
____________________________________________________________________________________________________
batch_normalization_43 (BatchNor (None, None, None, 16 480         conv2d_43[0][0]                  
____________________________________________________________________________________________________
batch_normalization_48 (BatchNor (None, None, None, 16 480         conv2d_48[0][0]                  
____________________________________________________________________________________________________
activation_43 (Activation)       (None, None, None, 16 0           batch_normalization_43[0][0]     
____________________________________________________________________________________________________
activation_48 (Activation)       (None, None, None, 16 0           batch_normalization_48[0][0]     
____________________________________________________________________________________________________
average_pooling2d_5 (AveragePool (None, None, None, 76 0           mixed4[0][0]                     
____________________________________________________________________________________________________
conv2d_41 (Conv2D)               (None, None, None, 19 147456      mixed4[0][0]                     
____________________________________________________________________________________________________
conv2d_44 (Conv2D)               (None, None, None, 19 215040      activation_43[0][0]              
____________________________________________________________________________________________________
conv2d_49 (Conv2D)               (None, None, None, 19 215040      activation_48[0][0]              
____________________________________________________________________________________________________
conv2d_50 (Conv2D)               (None, None, None, 19 147456      average_pooling2d_5[0][0]        
____________________________________________________________________________________________________
batch_normalization_41 (BatchNor (None, None, None, 19 576         conv2d_41[0][0]                  
____________________________________________________________________________________________________
batch_normalization_44 (BatchNor (None, None, None, 19 576         conv2d_44[0][0]                  
____________________________________________________________________________________________________
batch_normalization_49 (BatchNor (None, None, None, 19 576         conv2d_49[0][0]                  
____________________________________________________________________________________________________
batch_normalization_50 (BatchNor (None, None, None, 19 576         conv2d_50[0][0]                  
____________________________________________________________________________________________________
activation_41 (Activation)       (None, None, None, 19 0           batch_normalization_41[0][0]     
____________________________________________________________________________________________________
activation_44 (Activation)       (None, None, None, 19 0           batch_normalization_44[0][0]     
____________________________________________________________________________________________________
activation_49 (Activation)       (None, None, None, 19 0           batch_normalization_49[0][0]     
____________________________________________________________________________________________________
activation_50 (Activation)       (None, None, None, 19 0           batch_normalization_50[0][0]     
____________________________________________________________________________________________________
mixed5 (Concatenate)             (None, None, None, 76 0           activation_41[0][0]              
                                                                   activation_44[0][0]              
                                                                   activation_49[0][0]              
                                                                   activation_50[0][0]              
____________________________________________________________________________________________________
conv2d_55 (Conv2D)               (None, None, None, 16 122880      mixed5[0][0]                     
____________________________________________________________________________________________________
batch_normalization_55 (BatchNor (None, None, None, 16 480         conv2d_55[0][0]                  
____________________________________________________________________________________________________
activation_55 (Activation)       (None, None, None, 16 0           batch_normalization_55[0][0]     
____________________________________________________________________________________________________
conv2d_56 (Conv2D)               (None, None, None, 16 179200      activation_55[0][0]              
____________________________________________________________________________________________________
batch_normalization_56 (BatchNor (None, None, None, 16 480         conv2d_56[0][0]                  
____________________________________________________________________________________________________
activation_56 (Activation)       (None, None, None, 16 0           batch_normalization_56[0][0]     
____________________________________________________________________________________________________
conv2d_52 (Conv2D)               (None, None, None, 16 122880      mixed5[0][0]                     
____________________________________________________________________________________________________
conv2d_57 (Conv2D)               (None, None, None, 16 179200      activation_56[0][0]              
____________________________________________________________________________________________________
batch_normalization_52 (BatchNor (None, None, None, 16 480         conv2d_52[0][0]                  
____________________________________________________________________________________________________
batch_normalization_57 (BatchNor (None, None, None, 16 480         conv2d_57[0][0]                  
____________________________________________________________________________________________________
activation_52 (Activation)       (None, None, None, 16 0           batch_normalization_52[0][0]     
____________________________________________________________________________________________________
activation_57 (Activation)       (None, None, None, 16 0           batch_normalization_57[0][0]     
____________________________________________________________________________________________________
conv2d_53 (Conv2D)               (None, None, None, 16 179200      activation_52[0][0]              
____________________________________________________________________________________________________
conv2d_58 (Conv2D)               (None, None, None, 16 179200      activation_57[0][0]              
____________________________________________________________________________________________________
batch_normalization_53 (BatchNor (None, None, None, 16 480         conv2d_53[0][0]                  
____________________________________________________________________________________________________
batch_normalization_58 (BatchNor (None, None, None, 16 480         conv2d_58[0][0]                  
____________________________________________________________________________________________________
activation_53 (Activation)       (None, None, None, 16 0           batch_normalization_53[0][0]     
____________________________________________________________________________________________________
activation_58 (Activation)       (None, None, None, 16 0           batch_normalization_58[0][0]     
____________________________________________________________________________________________________
average_pooling2d_6 (AveragePool (None, None, None, 76 0           mixed5[0][0]                     
____________________________________________________________________________________________________
conv2d_51 (Conv2D)               (None, None, None, 19 147456      mixed5[0][0]                     
____________________________________________________________________________________________________
conv2d_54 (Conv2D)               (None, None, None, 19 215040      activation_53[0][0]              
____________________________________________________________________________________________________
conv2d_59 (Conv2D)               (None, None, None, 19 215040      activation_58[0][0]              
____________________________________________________________________________________________________
conv2d_60 (Conv2D)               (None, None, None, 19 147456      average_pooling2d_6[0][0]        
____________________________________________________________________________________________________
batch_normalization_51 (BatchNor (None, None, None, 19 576         conv2d_51[0][0]                  
____________________________________________________________________________________________________
batch_normalization_54 (BatchNor (None, None, None, 19 576         conv2d_54[0][0]                  
____________________________________________________________________________________________________
batch_normalization_59 (BatchNor (None, None, None, 19 576         conv2d_59[0][0]                  
____________________________________________________________________________________________________
batch_normalization_60 (BatchNor (None, None, None, 19 576         conv2d_60[0][0]                  
____________________________________________________________________________________________________
activation_51 (Activation)       (None, None, None, 19 0           batch_normalization_51[0][0]     
____________________________________________________________________________________________________
activation_54 (Activation)       (None, None, None, 19 0           batch_normalization_54[0][0]     
____________________________________________________________________________________________________
activation_59 (Activation)       (None, None, None, 19 0           batch_normalization_59[0][0]     
____________________________________________________________________________________________________
activation_60 (Activation)       (None, None, None, 19 0           batch_normalization_60[0][0]     
____________________________________________________________________________________________________
mixed6 (Concatenate)             (None, None, None, 76 0           activation_51[0][0]              
                                                                   activation_54[0][0]              
                                                                   activation_59[0][0]              
                                                                   activation_60[0][0]              
____________________________________________________________________________________________________
conv2d_65 (Conv2D)               (None, None, None, 19 147456      mixed6[0][0]                     
____________________________________________________________________________________________________
batch_normalization_65 (BatchNor (None, None, None, 19 576         conv2d_65[0][0]                  
____________________________________________________________________________________________________
activation_65 (Activation)       (None, None, None, 19 0           batch_normalization_65[0][0]     
____________________________________________________________________________________________________
conv2d_66 (Conv2D)               (None, None, None, 19 258048      activation_65[0][0]              
____________________________________________________________________________________________________
batch_normalization_66 (BatchNor (None, None, None, 19 576         conv2d_66[0][0]                  
____________________________________________________________________________________________________
activation_66 (Activation)       (None, None, None, 19 0           batch_normalization_66[0][0]     
____________________________________________________________________________________________________
conv2d_62 (Conv2D)               (None, None, None, 19 147456      mixed6[0][0]                     
____________________________________________________________________________________________________
conv2d_67 (Conv2D)               (None, None, None, 19 258048      activation_66[0][0]              
____________________________________________________________________________________________________
batch_normalization_62 (BatchNor (None, None, None, 19 576         conv2d_62[0][0]                  
____________________________________________________________________________________________________
batch_normalization_67 (BatchNor (None, None, None, 19 576         conv2d_67[0][0]                  
____________________________________________________________________________________________________
activation_62 (Activation)       (None, None, None, 19 0           batch_normalization_62[0][0]     
____________________________________________________________________________________________________
activation_67 (Activation)       (None, None, None, 19 0           batch_normalization_67[0][0]     
____________________________________________________________________________________________________
conv2d_63 (Conv2D)               (None, None, None, 19 258048      activation_62[0][0]              
____________________________________________________________________________________________________
conv2d_68 (Conv2D)               (None, None, None, 19 258048      activation_67[0][0]              
____________________________________________________________________________________________________
batch_normalization_63 (BatchNor (None, None, None, 19 576         conv2d_63[0][0]                  
____________________________________________________________________________________________________
batch_normalization_68 (BatchNor (None, None, None, 19 576         conv2d_68[0][0]                  
____________________________________________________________________________________________________
activation_63 (Activation)       (None, None, None, 19 0           batch_normalization_63[0][0]     
____________________________________________________________________________________________________
activation_68 (Activation)       (None, None, None, 19 0           batch_normalization_68[0][0]     
____________________________________________________________________________________________________
average_pooling2d_7 (AveragePool (None, None, None, 76 0           mixed6[0][0]                     
____________________________________________________________________________________________________
conv2d_61 (Conv2D)               (None, None, None, 19 147456      mixed6[0][0]                     
____________________________________________________________________________________________________
conv2d_64 (Conv2D)               (None, None, None, 19 258048      activation_63[0][0]              
____________________________________________________________________________________________________
conv2d_69 (Conv2D)               (None, None, None, 19 258048      activation_68[0][0]              
____________________________________________________________________________________________________
conv2d_70 (Conv2D)               (None, None, None, 19 147456      average_pooling2d_7[0][0]        
____________________________________________________________________________________________________
batch_normalization_61 (BatchNor (None, None, None, 19 576         conv2d_61[0][0]                  
____________________________________________________________________________________________________
batch_normalization_64 (BatchNor (None, None, None, 19 576         conv2d_64[0][0]                  
____________________________________________________________________________________________________
batch_normalization_69 (BatchNor (None, None, None, 19 576         conv2d_69[0][0]                  
____________________________________________________________________________________________________
batch_normalization_70 (BatchNor (None, None, None, 19 576         conv2d_70[0][0]                  
____________________________________________________________________________________________________
activation_61 (Activation)       (None, None, None, 19 0           batch_normalization_61[0][0]     
____________________________________________________________________________________________________
activation_64 (Activation)       (None, None, None, 19 0           batch_normalization_64[0][0]     
____________________________________________________________________________________________________
activation_69 (Activation)       (None, None, None, 19 0           batch_normalization_69[0][0]     
____________________________________________________________________________________________________
activation_70 (Activation)       (None, None, None, 19 0           batch_normalization_70[0][0]     
____________________________________________________________________________________________________
mixed7 (Concatenate)             (None, None, None, 76 0           activation_61[0][0]              
                                                                   activation_64[0][0]              
                                                                   activation_69[0][0]              
                                                                   activation_70[0][0]              
____________________________________________________________________________________________________
conv2d_73 (Conv2D)               (None, None, None, 19 147456      mixed7[0][0]                     
____________________________________________________________________________________________________
batch_normalization_73 (BatchNor (None, None, None, 19 576         conv2d_73[0][0]                  
____________________________________________________________________________________________________
activation_73 (Activation)       (None, None, None, 19 0           batch_normalization_73[0][0]     
____________________________________________________________________________________________________
conv2d_74 (Conv2D)               (None, None, None, 19 258048      activation_73[0][0]              
____________________________________________________________________________________________________
batch_normalization_74 (BatchNor (None, None, None, 19 576         conv2d_74[0][0]                  
____________________________________________________________________________________________________
activation_74 (Activation)       (None, None, None, 19 0           batch_normalization_74[0][0]     
____________________________________________________________________________________________________
conv2d_71 (Conv2D)               (None, None, None, 19 147456      mixed7[0][0]                     
____________________________________________________________________________________________________
conv2d_75 (Conv2D)               (None, None, None, 19 258048      activation_74[0][0]              
____________________________________________________________________________________________________
batch_normalization_71 (BatchNor (None, None, None, 19 576         conv2d_71[0][0]                  
____________________________________________________________________________________________________
batch_normalization_75 (BatchNor (None, None, None, 19 576         conv2d_75[0][0]                  
____________________________________________________________________________________________________
activation_71 (Activation)       (None, None, None, 19 0           batch_normalization_71[0][0]     
____________________________________________________________________________________________________
activation_75 (Activation)       (None, None, None, 19 0           batch_normalization_75[0][0]     
____________________________________________________________________________________________________
conv2d_72 (Conv2D)               (None, None, None, 32 552960      activation_71[0][0]              
____________________________________________________________________________________________________
conv2d_76 (Conv2D)               (None, None, None, 19 331776      activation_75[0][0]              
____________________________________________________________________________________________________
batch_normalization_72 (BatchNor (None, None, None, 32 960         conv2d_72[0][0]                  
____________________________________________________________________________________________________
batch_normalization_76 (BatchNor (None, None, None, 19 576         conv2d_76[0][0]                  
____________________________________________________________________________________________________
activation_72 (Activation)       (None, None, None, 32 0           batch_normalization_72[0][0]     
____________________________________________________________________________________________________
activation_76 (Activation)       (None, None, None, 19 0           batch_normalization_76[0][0]     
____________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)   (None, None, None, 76 0           mixed7[0][0]                     
____________________________________________________________________________________________________
mixed8 (Concatenate)             (None, None, None, 12 0           activation_72[0][0]              
                                                                   activation_76[0][0]              
                                                                   max_pooling2d_4[0][0]            
____________________________________________________________________________________________________
conv2d_81 (Conv2D)               (None, None, None, 44 573440      mixed8[0][0]                     
____________________________________________________________________________________________________
batch_normalization_81 (BatchNor (None, None, None, 44 1344        conv2d_81[0][0]                  
____________________________________________________________________________________________________
activation_81 (Activation)       (None, None, None, 44 0           batch_normalization_81[0][0]     
____________________________________________________________________________________________________
conv2d_78 (Conv2D)               (None, None, None, 38 491520      mixed8[0][0]                     
____________________________________________________________________________________________________
conv2d_82 (Conv2D)               (None, None, None, 38 1548288     activation_81[0][0]              
____________________________________________________________________________________________________
batch_normalization_78 (BatchNor (None, None, None, 38 1152        conv2d_78[0][0]                  
____________________________________________________________________________________________________
batch_normalization_82 (BatchNor (None, None, None, 38 1152        conv2d_82[0][0]                  
____________________________________________________________________________________________________
activation_78 (Activation)       (None, None, None, 38 0           batch_normalization_78[0][0]     
____________________________________________________________________________________________________
activation_82 (Activation)       (None, None, None, 38 0           batch_normalization_82[0][0]     
____________________________________________________________________________________________________
conv2d_79 (Conv2D)               (None, None, None, 38 442368      activation_78[0][0]              
____________________________________________________________________________________________________
conv2d_80 (Conv2D)               (None, None, None, 38 442368      activation_78[0][0]              
____________________________________________________________________________________________________
conv2d_83 (Conv2D)               (None, None, None, 38 442368      activation_82[0][0]              
____________________________________________________________________________________________________
conv2d_84 (Conv2D)               (None, None, None, 38 442368      activation_82[0][0]              
____________________________________________________________________________________________________
average_pooling2d_8 (AveragePool (None, None, None, 12 0           mixed8[0][0]                     
____________________________________________________________________________________________________
conv2d_77 (Conv2D)               (None, None, None, 32 409600      mixed8[0][0]                     
____________________________________________________________________________________________________
batch_normalization_79 (BatchNor (None, None, None, 38 1152        conv2d_79[0][0]                  
____________________________________________________________________________________________________
batch_normalization_80 (BatchNor (None, None, None, 38 1152        conv2d_80[0][0]                  
____________________________________________________________________________________________________
batch_normalization_83 (BatchNor (None, None, None, 38 1152        conv2d_83[0][0]                  
____________________________________________________________________________________________________
batch_normalization_84 (BatchNor (None, None, None, 38 1152        conv2d_84[0][0]                  
____________________________________________________________________________________________________
conv2d_85 (Conv2D)               (None, None, None, 19 245760      average_pooling2d_8[0][0]        
____________________________________________________________________________________________________
batch_normalization_77 (BatchNor (None, None, None, 32 960         conv2d_77[0][0]                  
____________________________________________________________________________________________________
activation_79 (Activation)       (None, None, None, 38 0           batch_normalization_79[0][0]     
____________________________________________________________________________________________________
activation_80 (Activation)       (None, None, None, 38 0           batch_normalization_80[0][0]     
____________________________________________________________________________________________________
activation_83 (Activation)       (None, None, None, 38 0           batch_normalization_83[0][0]     
____________________________________________________________________________________________________
activation_84 (Activation)       (None, None, None, 38 0           batch_normalization_84[0][0]     
____________________________________________________________________________________________________
batch_normalization_85 (BatchNor (None, None, None, 19 576         conv2d_85[0][0]                  
____________________________________________________________________________________________________
activation_77 (Activation)       (None, None, None, 32 0           batch_normalization_77[0][0]     
____________________________________________________________________________________________________
mixed9_0 (Concatenate)           (None, None, None, 76 0           activation_79[0][0]              
                                                                   activation_80[0][0]              
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, None, None, 76 0           activation_83[0][0]              
                                                                   activation_84[0][0]              
____________________________________________________________________________________________________
activation_85 (Activation)       (None, None, None, 19 0           batch_normalization_85[0][0]     
____________________________________________________________________________________________________
mixed9 (Concatenate)             (None, None, None, 20 0           activation_77[0][0]              
                                                                   mixed9_0[0][0]                   
                                                                   concatenate_1[0][0]              
                                                                   activation_85[0][0]              
____________________________________________________________________________________________________
conv2d_90 (Conv2D)               (None, None, None, 44 917504      mixed9[0][0]                     
____________________________________________________________________________________________________
batch_normalization_90 (BatchNor (None, None, None, 44 1344        conv2d_90[0][0]                  
____________________________________________________________________________________________________
activation_90 (Activation)       (None, None, None, 44 0           batch_normalization_90[0][0]     
____________________________________________________________________________________________________
conv2d_87 (Conv2D)               (None, None, None, 38 786432      mixed9[0][0]                     
____________________________________________________________________________________________________
conv2d_91 (Conv2D)               (None, None, None, 38 1548288     activation_90[0][0]              
____________________________________________________________________________________________________
batch_normalization_87 (BatchNor (None, None, None, 38 1152        conv2d_87[0][0]                  
____________________________________________________________________________________________________
batch_normalization_91 (BatchNor (None, None, None, 38 1152        conv2d_91[0][0]                  
____________________________________________________________________________________________________
activation_87 (Activation)       (None, None, None, 38 0           batch_normalization_87[0][0]     
____________________________________________________________________________________________________
activation_91 (Activation)       (None, None, None, 38 0           batch_normalization_91[0][0]     
____________________________________________________________________________________________________
conv2d_88 (Conv2D)               (None, None, None, 38 442368      activation_87[0][0]              
____________________________________________________________________________________________________
conv2d_89 (Conv2D)               (None, None, None, 38 442368      activation_87[0][0]              
____________________________________________________________________________________________________
conv2d_92 (Conv2D)               (None, None, None, 38 442368      activation_91[0][0]              
____________________________________________________________________________________________________
conv2d_93 (Conv2D)               (None, None, None, 38 442368      activation_91[0][0]              
____________________________________________________________________________________________________
average_pooling2d_9 (AveragePool (None, None, None, 20 0           mixed9[0][0]                     
____________________________________________________________________________________________________
conv2d_86 (Conv2D)               (None, None, None, 32 655360      mixed9[0][0]                     
____________________________________________________________________________________________________
batch_normalization_88 (BatchNor (None, None, None, 38 1152        conv2d_88[0][0]                  
____________________________________________________________________________________________________
batch_normalization_89 (BatchNor (None, None, None, 38 1152        conv2d_89[0][0]                  
____________________________________________________________________________________________________
batch_normalization_92 (BatchNor (None, None, None, 38 1152        conv2d_92[0][0]                  
____________________________________________________________________________________________________
batch_normalization_93 (BatchNor (None, None, None, 38 1152        conv2d_93[0][0]                  
____________________________________________________________________________________________________
conv2d_94 (Conv2D)               (None, None, None, 19 393216      average_pooling2d_9[0][0]        
____________________________________________________________________________________________________
batch_normalization_86 (BatchNor (None, None, None, 32 960         conv2d_86[0][0]                  
____________________________________________________________________________________________________
activation_88 (Activation)       (None, None, None, 38 0           batch_normalization_88[0][0]     
____________________________________________________________________________________________________
activation_89 (Activation)       (None, None, None, 38 0           batch_normalization_89[0][0]     
____________________________________________________________________________________________________
activation_92 (Activation)       (None, None, None, 38 0           batch_normalization_92[0][0]     
____________________________________________________________________________________________________
activation_93 (Activation)       (None, None, None, 38 0           batch_normalization_93[0][0]     
____________________________________________________________________________________________________
batch_normalization_94 (BatchNor (None, None, None, 19 576         conv2d_94[0][0]                  
____________________________________________________________________________________________________
activation_86 (Activation)       (None, None, None, 32 0           batch_normalization_86[0][0]     
____________________________________________________________________________________________________
mixed9_1 (Concatenate)           (None, None, None, 76 0           activation_88[0][0]              
                                                                   activation_89[0][0]              
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, None, None, 76 0           activation_92[0][0]              
                                                                   activation_93[0][0]              
____________________________________________________________________________________________________
activation_94 (Activation)       (None, None, None, 19 0           batch_normalization_94[0][0]     
____________________________________________________________________________________________________
mixed10 (Concatenate)            (None, None, None, 20 0           activation_86[0][0]              
                                                                   mixed9_1[0][0]                   
                                                                   concatenate_2[0][0]              
                                                                   activation_94[0][0]              
____________________________________________________________________________________________________
avg_pool (GlobalAveragePooling2D (None, 2048)          0           mixed10[0][0]                    
____________________________________________________________________________________________________
predictions (Dense)              (None, 1000)          2049000     avg_pool[0][0]                   
====================================================================================================
Total params: 23,851,784
Trainable params: 23,817,352
Non-trainable params: 34,432
'''

# 我们可以看到最后一个卷积层被称为“block5_pool”，所以我们使用Keras来获得对该层的引用。
transfer_layer = model.get_layer('avg_pool') # [N,2048]

# 我们将这个层称为传输层，因为它的输出将被重新路由到我们的新的完全连接的神经网络，这将对Knifey-Spoony数据集进行分类
'''
使用Keras API创建新模型非常简单。 首先，我们将VGG16模型的一部分从输入层迁移到传输层的输出。 
我们可以称之为卷积模型，因为它由VGG16模型的所有卷积层组成。
'''
conv_model = Model(inputs=model.input,
                   outputs=transfer_layer.output) # 将VGG16 input_1到block5_pool这部分的网络提取出来

# 然后，我们可以使用Keras在此之上建立一个新的模型。
new_model = Sequential()
new_model.add(conv_model) # [None, 7, 7, 512]
new_model.add(Flatten()) # [n,7*7*512]
new_model.add(Dense(1024, activation='relu')) # [n,1024]
new_model.add(Dropout(0.5))
new_model.add(Dense(num_classes, activation='softmax')) # [n,num_classes]

'''
我们使用Adam优化器的学习率相当低。 学习率也许可能更大。 
但是如果你尝试和训练更多层的原始VGG16模型，那么学习率应该是相当低的，
否则VGG16模型的预训练权重将会失真，并且将无法学习。
'''
optimizer = Adam(lr=1e-5)

# 我们在Knifey-Spoony数据集中有3个类，所以Keras需要使用这个loss函数。
loss = 'categorical_crossentropy'

# 我们感兴趣的唯一性能指标是分类精度。
metrics = ['categorical_accuracy']

# 在迁移学习中，我们最初只想重复使用预先训练的VGG16模型，所以我们将禁用所有层的训练(不更新)。
conv_model.trainable = False
for layer in conv_model.layers:
    layer.trainable = False

# 一旦我们改变了模型的图层是否可以训练，我们需要编译模型以使更改生效。
new_model.compile(optimizer=optimizer, loss=loss, metrics=metrics)

epochs = 20
steps_per_epoch = 100

# 训练新模型只是Keras API中的一个函数调用。 GTX 1070 GPU需要大约6-7分钟的时间。
history = new_model.fit_generator(generator=generator_train,
                                  epochs=epochs,
                                  steps_per_epoch=steps_per_epoch,
                                  class_weight=class_weight,
                                  validation_data=generator_test,
                                  validation_steps=steps_test)

# 这绘制了在使用Keras API进行培训期间记录的分类准确度和损失值。
def plot_training_history(history):
    # Get the classification accuracy and loss-value
    # for the training-set.
    acc = history.history['categorical_accuracy']
    loss = history.history['loss']

    # Get it for the validation-set (we only use the test-set).
    val_acc = history.history['val_categorical_accuracy']
    val_loss = history.history['val_loss']

    # Plot the accuracy and loss-values for the training-set.
    plt.plot(acc, linestyle='-', color='b', label='Training Acc.')
    plt.plot(loss, 'o', color='b', label='Training Loss')

    # Plot it for the test-set.
    plt.plot(val_acc, linestyle='--', color='r', label='Test Acc.')
    plt.plot(val_loss, 'o', color='r', label='Test Loss')

    # Plot title and legend.
    plt.title('Training and Test Accuracy')
    plt.legend()

    # Ensure the plot shows correctly.
    plt.show()


'''
Keras在每个epoch结束时记录性能指标，以便稍后进行绘制。 
这表明训练集的损失值在训练期间通常减少，但是测试集的损失值更不稳定。 
类似地，训练集的分类准确性通常有所提高，而测试集的分类准确度则更为不稳定。
'''
plot_training_history(history)

# 在训练之后，我们还可以使用Keras API中的单个函数调用来评估新模型在测试集上的性能。
result = new_model.evaluate_generator(generator_test, steps=steps_test)
print("Test-set classification accuracy: {0:.2%}".format(result[1]))

